# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

print('Sum:', sum(list(map(int, input('Number: ').replace('.', '0').replace('-', '0')))))