# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# n=1
print(*(n := n * i if i > 1 else i for i in range(1, int(input('Number: ')) + 1)))
"""
Странное дело, если добавляю условие if, 
то не требует определять перменную "n" и присваивать значение,
как только убираю сразу ругается, что не понимает что за "n" такая!
Вообщем если без if, то придется в 2 строчки писать код :) 
"""

# Через функцию math factorial
# import math
# print(*(math.factorial(i) for i in range(1, int(input('Number: ')) + 1)))
