# Реализуйте алгоритм перемешивания списка.

import random

# Решение №1 через функцию random
lst = [1, 2, 3, 'hello', 5, 6, 'world', 7, 8]
print(f'Original -->', lst)
print('Random 1 -->', random.sample(lst, len(lst)))

'''
Решение №2
Хотел написать рандом без использования сторонних функций, но что-то пошло не так.
Без дополнительного ввода данных от пользователя не создать хаус. 
В итоге пришлось использовать функцию времени, так как время величина переменчивая, особенно в миллисекундах.
Через функцию сделал исключительно в познавательных целях!
'''


def my_Random(lst):
    import time
    value = round(time.time() * 1000) % 10  # Получаем последнюю цифру из времени в миллисекундах
    for i in range(len(lst)):
        if value < len(lst):  # убеждаемся что значение(миллисекунд) не выползает за границы списка
            lst[i], lst[-value] = lst[-value], lst[i]
            value = int(((time.time() * 1000) % 1000) // 100 - i)  # для большей рандомности меняем индекс
        else:  # на случай если все же выползем за пределы списка
            value = 0
    return lst


print('Random 2 -->', my_Random(lst))
