# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

x = int(input('Введите номер четверти от 1 до 4: '))
if x == 1:
    print('Возможные координаты X > 0 и Y > 0')
if x == 2:
    print('Возможные координаты X < 0 и Y > 0')
if x == 3:
    print('Возможные координаты X < 0 и Y < 0')
if x == 4:
    print('Возможные координаты X > 0 и Y < 0')
