# Напишите программу, которая принимает на вход координаты двух точек и
# находит расстояние между ними в 2D пространстве.
import math

x = input('Введите координаты точки А через пробел: ').split()
y = input('Введите координаты точки В через пробел: ').split()
print(round((math.sqrt((float(y[0]) - float(x[0])) ** 2 + (float(y[1]) - float(x[1])) ** 2)), 2))